//
//  Info.swift
//  DemoDynamicPrototypes
//
//  Created by Chao Shin on 2018/4/29.
//  Copyright © 2018 Chao Shin. All rights reserved.
//

import Foundation

struct Information {
    let name: String
    let explainText: String
    let thumbnalImage: String
    let imageName: String
}

struct explainKeys {
    static let original = "【原味冰淇淋】選用台灣的有機通路專賣的鮮奶之外，還加了點鮮奶油增加滑順感，單純乳香的冰淇淋綿密醇厚、濃，奶香略帶點鹹，冰淇淋口感綿細滑順，奶香濃郁。"
    static let honeyComb = "【蜂巢冰淇淋】招牌人氣款直接將整塊蜂巢放上冰淇淋，為確保您品嚐到真實天然的甜美，而非人工製糖的甜味。巢蜜是最完美、最頂級的蜂蜜來源，不但蔗糖含量極少，還含有多種礦物質、微量元素、胺基酸、酵素等健康因子。"
    static let combHoney = "【巢蜜冰淇淋】集蜂巢裡流出的蜂蜜，比市面上販售的蜂蜜更濃郁香氣十足。巢蜜是最完美、最頂級的蜂蜜來源，不但蔗糖含量極少，還含有多種礦物質、微量元素、胺基酸、酵素等健康因子，自古以來，被譽為滋補養生聖品。"
    static let affogato = "【濃縮咖啡】是由濃縮咖啡和奶香濃郁的冰淇淋結合義大利甜品。淋上香醇濃郁的Espresso倒在冰淇淋上面，暖熱的咖啡香瞬間融化冰淇淋的奶香，微甜中口感帶點苦澀的咖啡香味，讓人享受幸福甜蜜時光的短暫記憶美好。"
    static let organicCottonCandyAffogato = "【有機棉花糖咖啡】香濃的義式濃縮咖啡、柔軟白色雲朵樣的棉花糖與絲滑濃郁的原味牛奶冰淇淋，浪漫唯美的外表下究竟藏著怎樣神奇的味覺碰撞呢？"
    static let organicCottonCandy = "【有機棉花糖】頂級冰淇淋戴上蓬鬆棉花糖假髮，大開心的繽紛形象，這才是冰淇淋存在世界的真諦！除了給您視覺滿分的幸福感之外，棉花糖冰淇淋更帶來意想不到的味覺新體驗。"
    static let organicMixedGrains = "【有機混合穀粉】綿滑濃郁的頂級冰淇淋，杯底先有焦糖香為基底，上層撒上粗顆粒有機混合穀粉和黃豆、糙米、黑芝麻、亞麻仁籽、黑豆、燕麥、黑麥、黑糯米與珍珠大麥交織的大地之味，多層次口感、多層次香氣。"
    static let darkChocolate = "【黑巧克力淋醬】黑巧克力的香、醇、濃郁很受喜愛巧克力的你和小朋友們喜愛口味。我們特別選用二種不同口感的巧克力製作，最後再加上粉紅色岩鹽提味，將黑巧克力味道更加柔和也溶入你口、甜到心坎。"
    static let chocolateBeans = "【巧克力球】先以巧克力球為底再加上濃郁奶香的冰淇淋最後會再加上巧克力，滿滿可愛甜蜜黑巧克力球，一咬巧克力球外層巧克力的香氣濃郁、好吃又神奇的麥花，包裹著外層巧克力與麥片的香香碎碎滋味清爽。"
    static let castellaCake = "【長崎蛋糕】~長崎蛋糕~上層有一層約0.2公分厚的棕色餅皮，中間有那淡黃色綿綿密密的蛋糕，一口蛋糕的香氣與一口濃郁奶味的冰淇淋柔，吃起來軟綿入口，香氣入喉，開心滿分，我們就是想讓您口感上嚐試多種不同的感受體驗。"
    static let popCorn = "【爆米花】焦糖的香氣與爆米花酥脆的口感，盛裝杯內會在加上一層焦糖醬，爆米花與口感綿細滑順的奶香濃郁冰淇淋，吃進嘴裡這款爆米花在口感上相當有豐富度與咀嚼多重度，讓您味蕾上充滿奶香與焦糖味的多重滋味縈繞唇舌之間。"
    static let yuanyangMilkTea = "【鴛鴦奶茶】純鮮奶口味的冰淇淋加上道地的埔里紅茶與領導品牌的Nespresso 咖啡，變身成為鴛鴦奶茶。奶香層次分明的鴛鴦有牛奶質地口感、原葉紅茶香氣餘繞，還有咖啡的韻味，奶香茶香咖啡香一次多重味覺饗宴。"
    static let yuanyangMilkTeaWithBoba = "【珍珠鴛鴦奶茶】飽滿晶透吸收黑糖的香與蜂蜜的甜Q滑珍珠與鴛鴦奶茶結合在一起，品嚐多元味蕾與口感的交錯，讓你有充滿甜蜜的飽足感。"
    static let baconWithChocolate = "【培根巧克力】純鮮奶濃郁奶香冰淇淋搭配雙重巧克力醬和酥烤培根碎片，鹹鹹甜甜雙重口味交錯下，咀嚼培根碎片的香氣與巧克力微甜的滋味，搭上軟滑冰淇淋刺激您的味蕾感受，給您全新難忘冰品饗宴。"
    static let churros = "【啾拿棒】現烤香酥細細長長甜滋滋的西班牙甜點Churro 啾拿棒撒上肉桂粉，其酥酥熱熱香氣口感搭配冰甜、軟柔滑順的冰淇淋，冷熱交織口感與層次分明味覺交融在嘴裡奇特美妙滋味待您來品嚐。"
    static let baileysOriginal = "【杏片奶酒】當濃厚的牛奶冰淇淋遇上貝禮斯奶酒，如愛侶般一拍即合，軟滑的冰淇淋淋上醇馥的Baileys製造出比絲綢更順滑的口感，在鮮甜的牛奶冰淇淋中滲出馥郁酒香，再配上香烤脆脆杏仁片，醇厚順滑，不醉人更齒頰留香。"
    static let tiramisa = "【提拉米蘇】以即沖濃縮咖啡與貝禮斯奶酒融合，慢慢滲入冰淇淋及手指餅之中，配上濃濃奶香及高純度無糖可可粉。把咖啡、甜酒與冰淇淋合於一身，不但沒有搶去了冰淇淋的風頭，甜與苦就像天使與魔鬼，相抵卻又和諧地結合起來。"
    static let roseJamWithPoppingCottonCandy = "【玫瑰跳跳糖】玫瑰跳跳糖是一杯充滿驚喜的冰淇淋！葡萄棉花糖加上跳跳糖的化在嘴裡的彈跳口感，讓人吃了有種戀愛幸福的感覺，玫瑰花醬同時也帶來花香清新的感覺！"
    static let passionFruit = "【百香果】我們採用新鮮百香果露淋在鮮奶冰淇淋上，再撒上頂級新鮮水果乾增加口感強度，百香果的經典香氣，讓整體口感更顯輕盈。"
    static let durianAppleMixed = "【榴槤脆果】用百分之百榴槤製成的果乾研磨成粉，加上手工製作的榴槤蘋果醬，與牛奶冰淇淋搭配一點也不衝突，加上新鮮蘋果製成的蘋果乾，一整口都是夏天的味道。"
    static let cerealMilk = "【蜜糖脆片】柔順香濃的榖片牛奶口味冰淇淋，撒上烤過的蜜糖燕麥玉米脆片，玉米燕麥片富含鈣質與膳食纖維，交疊出豐富香脆口感，香味濃厚，不會太甜，黃金比例，吃久也不膩。"
    static let macaroon = "【馬卡龍】馬卡龍都是出自於一位瑞典甜點師傅手工精心製作。馬卡龍口味多元（巧克力，檸檬，伯爵茶，百香果，覆盆子，鹽漬焦糖，香草和咖啡）放到冰淇淋上方可愛大方，鬆軟的馬卡龍配上香濃牛奶冰淇淋，是一大享受啊！"
    static let pandan = "【香蘭葉】獨特熱帶國家才有的香蘭葉製作而成的冰淇淋口味，特有的香蘭葉味道，配上椰子脆片、亞答籽、米果餅乾，最後淋上椰糖，充滿熱帶國家氣息，這一味一定要試一下。"
}
